system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (-15.08   1.27   0) // 0
    (    0   1.27   0) // 1
    (    0   11.37   0) // 2
    (-15.08   11.37   0) // 3
    (-15.08   1.27   1) // 4
    (    0   1.27   1) // 5
    (    0   11.37   1) // 6
    (-15.08   11.37   1) // 7
    (   8   1.27   0) // 8
    (    8   11.37   0) // 9
    (    8   1.27   1) // 10
    ( 8   11.37   1) // 11
    ( 40.64   1.27   0) // 12
    ( 40.64   11.37   0) // 13
    ( 40.64   1.27   1) // 14
    ( 40.64   11.37   1) // 15
    (    0   0   0) // 16
    (    8   0   0) // 17
    (   0   0   1) // 18
    (    8   0   1) // 19
    (   40.64  0  0) // 20
    (   40.64  0  1) // 21
);


ySpacing ((0.3 0.47 250)(0.2 0.06 1)(0.3 0.47 0.004));
ySpacing2 ((0.75 0.3 1)(0.25 0.7 0.004));
yWall ((0.5 0.5 100)(0.5 0.5 0.03));

yLower1 ((0.4 0.7 50)(0.6 0.3 1));
yLower2 ((1 1 50));

//yUpper1 ((0.1 0.15 2)(0.75 0.35 4)(0.25 0.5 0.005));
yUpper1 ((0.1 0.2 2)(0.75 0.35 5)(0.25 0.45 0.005));

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (50 80 1)
   
    simpleGrading (0.30 ((0.5 0.5 206.67754)(0.5 0.5 0.00484)) 1)

    hex (1 8 9 2 5 10 11 6)
    (60 80 1)
   
    simpleGrading (3.33 ((0.5 0.5 206.67754)(0.5 0.5 0.00484)) 1)

    hex (8 12 13 9 10 14 15 11)
    (40 80 1)
   
    simpleGrading (1.00 ((0.5 0.5 206.67754)(0.5 0.5 0.00484)) 1)

    hex (16 17 8 1 18 19 10 5)
    (60 60 1)
   
    simpleGrading (3.33 10 1)

    hex (17 20 12 8 19 21 14 10)
    (40 60 1)
   
    simpleGrading (1 10 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (7 4 0 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 12 14 15)
            (12 20 21 14)
        );
    }
    lowerWallStartup
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
    upperWallStartup
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (2 6 11 9)
            (9 11 15 13)
        );
    }
    verticalWall
    {
        type wall;
        faces
        (
            (5 18 16 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (16 18 19 17)
            (17 19 21 20)
        );
    }
    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 8 9 2)
            (8 12 13 9)
            (1 16 17 8)
            (17 20 12 8)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
            (10 14 15 11)
            (18 19 10 5)
            (19 21 14 10)
        );
    }
);