system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1500;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc "stressComponents"
    #includeFunc "pressureCoefficient"
    #includeFunc "sample"
    #includeFunc "sampleCp"
    #includeFunc "writeCellCentres"
    #includeFunc "wallShearStress"
    #includeFunc solverInfo
    #include "lineExtraction"

    yPlus
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");

        writeControl    writeTime;   // or runTime
        //writeInterval   1;          // write every iteration

        log             yes;
    }
}


// ************************************************************************* //
